// 스마트기기
// 제조사명
// 가격

// 통화가 가능한 스마트기기
// 통신사명
// 통화하기

// 아이폰 (통화가 가능한 스마트기기)
// 모델명

// 아이패드 with Usim (통화가 가능한 스마트기기)
// 디스플레이 크기

// 아이패드 (유심이 없어서 통화가 불가능한 스마트기기)
// 디스플레이 크기

// 다이얼 전화기 (통화가 가능한 아날로그 기기)
// 다이얼 직경

// 1. 추상 메소드 (abstract method)? 메소드를 선언만 하고 구현하지 않은 것
// 2. 추상 클래스는 추상 메소드를 꼭 포함해야 하나요? 꼭 포함할 필요는 없음, 하지만 메소드를 작성한다면 하위 클래스에서 반드시 오버라이딩해야됨
// 3. 추상 클래스는 인스턴스화 할 수 있나요? 불가능! 하위 클래스를 통해서만 인스턴스화 가능
// 4. 추상 메소드를 포함한 추상 클래스를 상속해, 자식 클래스를 작성할 때 무엇을 수행해야 하나요? 해당 메소드를 오버라이딩해주는 메소드를 생성해야됨

// 5. 모든 클래스 계층에 최상위에 존재하는 Object 클래스에 정의된 equals(Object) 메소드를 자식 클래스에서 재정의하는 이유는? 
// - 기본적으로 Object 클래스에서 정의된 equals 메소드는 동일한 객체인지 (즉, 메모리 주소가 같은지) 비교함
// - 이것을 자식 클래스에서 재정의하여 객체의 속성값(필드값)을 기준으로 동등한지 비교할 수 있게됨
// - 이를 통해 객체의 논리적인 비교가 가능해짐




public class TestSmartDevices {

}
